<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"61a69401ea8645ddece29ff2a029f0579cad2a068e54b0443bcca1ba58f208d7","plan_job_ref":"Job terraform plan #61 at https://github.com/suzutan/infra/actions/runs/11199366470","plan_out_hash":"044e803110c0811471d1a54ea6acdfb8897c701eb552d91418ab26573b46670c","plan_hash":"d21602d006e1e9a50becf600a833a042b03cca04fce8ff3bf10f37f804e219bb","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/harvestasya.org__
<details>
<summary>Plan: 6 to add, 10 to change, 6 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # cloudflare_record.k8s_ingress["argocd.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_record" "k8s_ingress" {
!~      content         = "ea960d2f-1a46-46bc-87ec-b06dc28c9629.cfargotunnel.com" -> (known after apply)
        id              = "8fec09985f0e56eac46eb76940d580be"
        name            = "argocd.harvestasya.org"
        tags            = []
#        (12 unchanged attributes hidden)
    }

  # cloudflare_record.k8s_ingress["echoserver.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_record" "k8s_ingress" {
!~      content         = "ea960d2f-1a46-46bc-87ec-b06dc28c9629.cfargotunnel.com" -> (known after apply)
        id              = "456541c7f5c573e1d46bffb9ca346a0a"
        name            = "echoserver.harvestasya.org"
        tags            = []
#        (12 unchanged attributes hidden)
    }

  # cloudflare_record.k8s_ingress["id.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_record" "k8s_ingress" {
!~      content         = "ea960d2f-1a46-46bc-87ec-b06dc28c9629.cfargotunnel.com" -> (known after apply)
        id              = "b4c1a7bfb5a8134333310f3ff1d3b3ed"
        name            = "id.harvestasya.org"
        tags            = []
#        (12 unchanged attributes hidden)
    }

  # cloudflare_record.k8s_ingress["navidrome-filebrowser.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_record" "k8s_ingress" {
!~      content         = "ea960d2f-1a46-46bc-87ec-b06dc28c9629.cfargotunnel.com" -> (known after apply)
        id              = "a7d2ff7edada64193d7cfe5d5debca32"
        name            = "navidrome-filebrowser.harvestasya.org"
        tags            = []
#        (12 unchanged attributes hidden)
    }

  # cloudflare_record.k8s_ingress["navidrome.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_record" "k8s_ingress" {
!~      content         = "ea960d2f-1a46-46bc-87ec-b06dc28c9629.cfargotunnel.com" -> (known after apply)
        id              = "3284ae2a31a22a22e819f012122fb813"
        name            = "navidrome.harvestasya.org"
        tags            = []
#        (12 unchanged attributes hidden)
    }

  # cloudflare_record.metrics["grafana.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_record" "metrics" {
        id              = "129c204bf9c708bd8a984bdc4e2d7b31"
        name            = "grafana.harvestasya.org"
        tags            = []
!~      value           = "221883fd-b945-4f22-935d-be1bb6c7607a.cfargotunnel.com" -> (known after apply)
#        (12 unchanged attributes hidden)
    }

  # cloudflare_record.metrics["prometheus.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_record" "metrics" {
        id              = "d076e1b80b6d1c8d9715346ab3ad1211"
        name            = "prometheus.harvestasya.org"
        tags            = []
!~      value           = "221883fd-b945-4f22-935d-be1bb6c7607a.cfargotunnel.com" -> (known after apply)
#        (12 unchanged attributes hidden)
    }

  # cloudflare_record.storage_ingress["cdn.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_record" "storage_ingress" {
        id              = "c40206b0283ad433374246606c1459a9"
        name            = "cdn.harvestasya.org"
        tags            = []
!~      value           = "ae14e5bc-d84e-4719-ab38-df8ca6664918.cfargotunnel.com" -> (known after apply)
#        (12 unchanged attributes hidden)
    }

  # cloudflare_record.storage_ingress["storage-console.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_record" "storage_ingress" {
        id              = "f9862a8ff749beee2d9286ad36a79d02"
        name            = "storage-console.harvestasya.org"
        tags            = []
!~      value           = "ae14e5bc-d84e-4719-ab38-df8ca6664918.cfargotunnel.com" -> (known after apply)
#        (12 unchanged attributes hidden)
    }

  # cloudflare_record.storage_ingress["storage.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_record" "storage_ingress" {
        id              = "bd7c23a028652e7ef7e81647c92fcfa8"
        name            = "storage.harvestasya.org"
        tags            = []
!~      value           = "ae14e5bc-d84e-4719-ab38-df8ca6664918.cfargotunnel.com" -> (known after apply)
#        (12 unchanged attributes hidden)
    }

  # cloudflare_tunnel.k8s_ingress will be destroyed
  # (because cloudflare_tunnel.k8s_ingress is not in configuration)
-   resource "cloudflare_tunnel" "k8s_ingress" {
-       account_id   = "3b433b4bc6b6f9770dbf88886748ec8b" -> null
-       cname        = "ea960d2f-1a46-46bc-87ec-b06dc28c9629.cfargotunnel.com" -> null
-       id           = "ea960d2f-1a46-46bc-87ec-b06dc28c9629" -> null
-       name         = "k8s-ingress" -> null
-       secret       = (sensitive value) -> null
-       tunnel_token = (sensitive value) -> null
    }

  # cloudflare_tunnel.metrics will be destroyed
  # (because cloudflare_tunnel.metrics is not in configuration)
-   resource "cloudflare_tunnel" "metrics" {
-       account_id   = "3b433b4bc6b6f9770dbf88886748ec8b" -> null
-       cname        = "221883fd-b945-4f22-935d-be1bb6c7607a.cfargotunnel.com" -> null
-       id           = "221883fd-b945-4f22-935d-be1bb6c7607a" -> null
-       name         = "metrics-ingress" -> null
-       secret       = (sensitive value) -> null
-       tunnel_token = (sensitive value) -> null
    }

  # cloudflare_tunnel.storage_ingress will be destroyed
  # (because cloudflare_tunnel.storage_ingress is not in configuration)
-   resource "cloudflare_tunnel" "storage_ingress" {
-       account_id   = "3b433b4bc6b6f9770dbf88886748ec8b" -> null
-       cname        = "ae14e5bc-d84e-4719-ab38-df8ca6664918.cfargotunnel.com" -> null
-       id           = "ae14e5bc-d84e-4719-ab38-df8ca6664918" -> null
-       name         = "storage-ingress" -> null
-       secret       = (sensitive value) -> null
-       tunnel_token = (sensitive value) -> null
    }

  # cloudflare_tunnel_config.k8s_ingress will be destroyed
  # (because cloudflare_tunnel_config.k8s_ingress is not in configuration)
-   resource "cloudflare_tunnel_config" "k8s_ingress" {
-       account_id = "3b433b4bc6b6f9770dbf88886748ec8b" -> null
-       id         = "ea960d2f-1a46-46bc-87ec-b06dc28c9629" -> null
-       tunnel_id  = "ea960d2f-1a46-46bc-87ec-b06dc28c9629" -> null

-       config {
-           ingress_rule {
-               hostname = "argocd.harvestasya.org" -> null
-               service  = "https://traefik.traefik.svc.cluster.local" -> null
#                (1 unchanged attribute hidden)

-               origin_request {
-                   bastion_mode             = false -> null
-                   connect_timeout          = "30s" -> null
-                   disable_chunked_encoding = false -> null
-                   http2_origin             = false -> null
-                   http_host_header         = "argocd.harvestasya.org" -> null
-                   keep_alive_connections   = 100 -> null
-                   keep_alive_timeout       = "1m30s" -> null
-                   no_happy_eyeballs        = false -> null
-                   no_tls_verify            = false -> null
-                   origin_server_name       = "argocd.harvestasya.org" -> null
-                   proxy_address            = "127.0.0.1" -> null
-                   proxy_port               = 0 -> null
-                   tcp_keep_alive           = "30s" -> null
-                   tls_timeout              = "10s" -> null
#                    (2 unchanged attributes hidden)
                }
            }
-           ingress_rule {
-               hostname = "echoserver.harvestasya.org" -> null
-               service  = "https://traefik.traefik.svc.cluster.local" -> null
#                (1 unchanged attribute hidden)

-               origin_request {
-                   bastion_mode             = false -> null
-                   connect_timeout          = "30s" -> null
-                   disable_chunked_encoding = false -> null
-                   http2_origin             = false -> null
-                   http_host_header         = "echoserver.harvestasya.org" -> null
-                   keep_alive_connections   = 100 -> null
-                   keep_alive_timeout       = "1m30s" -> null
-                   no_happy_eyeballs        = false -> null
-                   no_tls_verify            = false -> null
-                   origin_server_name       = "echoserver.harvestasya.org" -> null
-                   proxy_address            = "127.0.0.1" -> null
-                   proxy_port               = 0 -> null
-                   tcp_keep_alive           = "30s" -> null
-                   tls_timeout              = "10s" -> null
#                    (2 unchanged attributes hidden)
                }
            }
-           ingress_rule {
-               hostname = "id.harvestasya.org" -> null
-               service  = "https://traefik.traefik.svc.cluster.local" -> null
#                (1 unchanged attribute hidden)

-               origin_request {
-                   bastion_mode             = false -> null
-                   connect_timeout          = "30s" -> null
-                   disable_chunked_encoding = false -> null
-                   http2_origin             = false -> null
-                   http_host_header         = "id.harvestasya.org" -> null
-                   keep_alive_connections   = 100 -> null
-                   keep_alive_timeout       = "1m30s" -> null
-                   no_happy_eyeballs        = false -> null
-                   no_tls_verify            = false -> null
-                   origin_server_name       = "id.harvestasya.org" -> null
-                   proxy_address            = "127.0.0.1" -> null
-                   proxy_port               = 0 -> null
-                   tcp_keep_alive           = "30s" -> null
-                   tls_timeout              = "10s" -> null
#                    (2 unchanged attributes hidden)
                }
            }
-           ingress_rule {
-               hostname = "navidrome-filebrowser.harvestasya.org" -> null
-               service  = "https://traefik.traefik.svc.cluster.local" -> null
#                (1 unchanged attribute hidden)

-               origin_request {
-                   bastion_mode             = false -> null
-                   connect_timeout          = "30s" -> null
-                   disable_chunked_encoding = false -> null
-                   http2_origin             = false -> null
-                   http_host_header         = "navidrome-filebrowser.harvestasya.org" -> null
-                   keep_alive_connections   = 100 -> null
-                   keep_alive_timeout       = "1m30s" -> null
-                   no_happy_eyeballs        = false -> null
-                   no_tls_verify            = false -> null
-                   origin_server_name       = "navidrome-filebrowser.harvestasya.org" -> null
-                   proxy_address            = "127.0.0.1" -> null
-                   proxy_port               = 0 -> null
-                   tcp_keep_alive           = "30s" -> null
-                   tls_timeout              = "10s" -> null
#                    (2 unchanged attributes hidden)
                }
            }
-           ingress_rule {
-               hostname = "navidrome.harvestasya.org" -> null
-               service  = "https://traefik.traefik.svc.cluster.local" -> null
#                (1 unchanged attribute hidden)

-               origin_request {
-                   bastion_mode             = false -> null
-                   connect_timeout          = "30s" -> null
-                   disable_chunked_encoding = false -> null
-                   http2_origin             = false -> null
-                   http_host_header         = "navidrome.harvestasya.org" -> null
-                   keep_alive_connections   = 100 -> null
-                   keep_alive_timeout       = "1m30s" -> null
-                   no_happy_eyeballs        = false -> null
-                   no_tls_verify            = false -> null
-                   origin_server_name       = "navidrome.harvestasya.org" -> null
-                   proxy_address            = "127.0.0.1" -> null
-                   proxy_port               = 0 -> null
-                   tcp_keep_alive           = "30s" -> null
-                   tls_timeout              = "10s" -> null
#                    (2 unchanged attributes hidden)
                }
            }
-           ingress_rule {
-               service  = "http_status:404" -> null
#                (2 unchanged attributes hidden)
            }
        }
    }

  # cloudflare_tunnel_config.metrics will be destroyed
  # (because cloudflare_tunnel_config.metrics is not in configuration)
-   resource "cloudflare_tunnel_config" "metrics" {
-       account_id = "3b433b4bc6b6f9770dbf88886748ec8b" -> null
-       id         = "221883fd-b945-4f22-935d-be1bb6c7607a" -> null
-       tunnel_id  = "221883fd-b945-4f22-935d-be1bb6c7607a" -> null

-       config {
-           ingress_rule {
-               hostname = "grafana.harvestasya.org" -> null
-               service  = "https://traefik" -> null
#                (1 unchanged attribute hidden)

-               origin_request {
-                   bastion_mode             = false -> null
-                   connect_timeout          = "30s" -> null
-                   disable_chunked_encoding = false -> null
-                   http2_origin             = false -> null
-                   http_host_header         = "grafana.harvestasya.org" -> null
-                   keep_alive_connections   = 100 -> null
-                   keep_alive_timeout       = "1m30s" -> null
-                   no_happy_eyeballs        = false -> null
-                   no_tls_verify            = true -> null
-                   origin_server_name       = "grafana.harvestasya.org" -> null
-                   proxy_address            = "127.0.0.1" -> null
-                   proxy_port               = 0 -> null
-                   tcp_keep_alive           = "30s" -> null
-                   tls_timeout              = "10s" -> null
#                    (2 unchanged attributes hidden)
                }
            }
-           ingress_rule {
-               hostname = "prometheus.harvestasya.org" -> null
-               service  = "https://traefik" -> null
#                (1 unchanged attribute hidden)

-               origin_request {
-                   bastion_mode             = false -> null
-                   connect_timeout          = "30s" -> null
-                   disable_chunked_encoding = false -> null
-                   http2_origin             = false -> null
-                   http_host_header         = "prometheus.harvestasya.org" -> null
-                   keep_alive_connections   = 100 -> null
-                   keep_alive_timeout       = "1m30s" -> null
-                   no_happy_eyeballs        = false -> null
-                   no_tls_verify            = true -> null
-                   origin_server_name       = "prometheus.harvestasya.org" -> null
-                   proxy_address            = "127.0.0.1" -> null
-                   proxy_port               = 0 -> null
-                   tcp_keep_alive           = "30s" -> null
-                   tls_timeout              = "10s" -> null
#                    (2 unchanged attributes hidden)
                }
            }
-           ingress_rule {
-               service  = "http_status:404" -> null
#                (2 unchanged attributes hidden)
            }
        }
    }

  # cloudflare_tunnel_config.storage_ingress will be destroyed
  # (because cloudflare_tunnel_config.storage_ingress is not in configuration)
-   resource "cloudflare_tunnel_config" "storage_ingress" {
-       account_id = "3b433b4bc6b6f9770dbf88886748ec8b" -> null
-       id         = "ae14e5bc-d84e-4719-ab38-df8ca6664918" -> null
-       tunnel_id  = "ae14e5bc-d84e-4719-ab38-df8ca6664918" -> null

-       config {
-           ingress_rule {
-               hostname = "cdn.harvestasya.org" -> null
-               service  = "https://traefik" -> null
#                (1 unchanged attribute hidden)

-               origin_request {
-                   bastion_mode             = false -> null
-                   connect_timeout          = "30s" -> null
-                   disable_chunked_encoding = false -> null
-                   http2_origin             = false -> null
-                   http_host_header         = "cdn.harvestasya.org" -> null
-                   keep_alive_connections   = 100 -> null
-                   keep_alive_timeout       = "1m30s" -> null
-                   no_happy_eyeballs        = false -> null
-                   no_tls_verify            = true -> null
-                   origin_server_name       = "cdn.harvestasya.org" -> null
-                   proxy_address            = "127.0.0.1" -> null
-                   proxy_port               = 0 -> null
-                   tcp_keep_alive           = "30s" -> null
-                   tls_timeout              = "10s" -> null
#                    (2 unchanged attributes hidden)
                }
            }
-           ingress_rule {
-               hostname = "storage-console.harvestasya.org" -> null
-               service  = "https://traefik" -> null
#                (1 unchanged attribute hidden)

-               origin_request {
-                   bastion_mode             = false -> null
-                   connect_timeout          = "30s" -> null
-                   disable_chunked_encoding = false -> null
-                   http2_origin             = false -> null
-                   http_host_header         = "storage-console.harvestasya.org" -> null
-                   keep_alive_connections   = 100 -> null
-                   keep_alive_timeout       = "1m30s" -> null
-                   no_happy_eyeballs        = false -> null
-                   no_tls_verify            = true -> null
-                   origin_server_name       = "storage-console.harvestasya.org" -> null
-                   proxy_address            = "127.0.0.1" -> null
-                   proxy_port               = 0 -> null
-                   tcp_keep_alive           = "30s" -> null
-                   tls_timeout              = "10s" -> null
#                    (2 unchanged attributes hidden)
                }
            }
-           ingress_rule {
-               hostname = "storage.harvestasya.org" -> null
-               service  = "https://traefik" -> null
#                (1 unchanged attribute hidden)

-               origin_request {
-                   bastion_mode             = false -> null
-                   connect_timeout          = "30s" -> null
-                   disable_chunked_encoding = false -> null
-                   http2_origin             = false -> null
-                   http_host_header         = "storage.harvestasya.org" -> null
-                   keep_alive_connections   = 100 -> null
-                   keep_alive_timeout       = "1m30s" -> null
-                   no_happy_eyeballs        = false -> null
-                   no_tls_verify            = true -> null
-                   origin_server_name       = "storage.harvestasya.org" -> null
-                   proxy_address            = "127.0.0.1" -> null
-                   proxy_port               = 0 -> null
-                   tcp_keep_alive           = "30s" -> null
-                   tls_timeout              = "10s" -> null
#                    (2 unchanged attributes hidden)
                }
            }
-           ingress_rule {
-               service  = "http_status:404" -> null
#                (2 unchanged attributes hidden)
            }
        }
    }

  # cloudflare_zero_trust_tunnel_cloudflared.k8s_ingress will be created
+   resource "cloudflare_zero_trust_tunnel_cloudflared" "k8s_ingress" {
+       account_id   = "********************************"
+       cname        = (known after apply)
+       id           = (known after apply)
+       name         = "k8s-ingress"
+       secret       = (sensitive value)
+       tunnel_token = (sensitive value)
    }

  # cloudflare_zero_trust_tunnel_cloudflared.metrics will be created
+   resource "cloudflare_zero_trust_tunnel_cloudflared" "metrics" {
+       account_id   = "********************************"
+       cname        = (known after apply)
+       id           = (known after apply)
+       name         = "metrics-ingress"
+       secret       = (sensitive value)
+       tunnel_token = (sensitive value)
    }

  # cloudflare_zero_trust_tunnel_cloudflared.storage_ingress will be created
+   resource "cloudflare_zero_trust_tunnel_cloudflared" "storage_ingress" {
+       account_id   = "********************************"
+       cname        = (known after apply)
+       id           = (known after apply)
+       name         = "storage-ingress"
+       secret       = (sensitive value)
+       tunnel_token = (sensitive value)
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.k8s_ingress will be created
+   resource "cloudflare_zero_trust_tunnel_cloudflared_config" "k8s_ingress" {
+       account_id = "********************************"
+       id         = (known after apply)
+       tunnel_id  = (known after apply)

+       config {
+           ingress_rule {
+               hostname = "argocd.harvestasya.org"
+               service  = "https://traefik.traefik.svc.cluster.local"

+               origin_request {
+                   connect_timeout          = "30s"
+                   disable_chunked_encoding = false
+                   http2_origin             = false
+                   http_host_header         = "argocd.harvestasya.org"
+                   keep_alive_connections   = 100
+                   keep_alive_timeout       = "1m30s"
+                   no_happy_eyeballs        = false
+                   no_tls_verify            = false
+                   origin_server_name       = "argocd.harvestasya.org"
+                   proxy_address            = "127.0.0.1"
+                   proxy_port               = 0
+                   tcp_keep_alive           = "30s"
+                   tls_timeout              = "10s"
                }
            }
+           ingress_rule {
+               hostname = "echoserver.harvestasya.org"
+               service  = "https://traefik.traefik.svc.cluster.local"

+               origin_request {
+                   connect_timeout          = "30s"
+                   disable_chunked_encoding = false
+                   http2_origin             = false
+                   http_host_header         = "echoserver.harvestasya.org"
+                   keep_alive_connections   = 100
+                   keep_alive_timeout       = "1m30s"
+                   no_happy_eyeballs        = false
+                   no_tls_verify            = false
+                   origin_server_name       = "echoserver.harvestasya.org"
+                   proxy_address            = "127.0.0.1"
+                   proxy_port               = 0
+                   tcp_keep_alive           = "30s"
+                   tls_timeout              = "10s"
                }
            }
+           ingress_rule {
+               hostname = "id.harvestasya.org"
+               service  = "https://traefik.traefik.svc.cluster.local"

+               origin_request {
+                   connect_timeout          = "30s"
+                   disable_chunked_encoding = false
+                   http2_origin             = false
+                   http_host_header         = "id.harvestasya.org"
+                   keep_alive_connections   = 100
+                   keep_alive_timeout       = "1m30s"
+                   no_happy_eyeballs        = false
+                   no_tls_verify            = false
+                   origin_server_name       = "id.harvestasya.org"
+                   proxy_address            = "127.0.0.1"
+                   proxy_port               = 0
+                   tcp_keep_alive           = "30s"
+                   tls_timeout              = "10s"
                }
            }
+           ingress_rule {
+               hostname = "navidrome-filebrowser.harvestasya.org"
+               service  = "https://traefik.traefik.svc.cluster.local"

+               origin_request {
+                   connect_timeout          = "30s"
+                   disable_chunked_encoding = false
+                   http2_origin             = false
+                   http_host_header         = "navidrome-filebrowser.harvestasya.org"
+                   keep_alive_connections   = 100
+                   keep_alive_timeout       = "1m30s"
+                   no_happy_eyeballs        = false
+                   no_tls_verify            = false
+                   origin_server_name       = "navidrome-filebrowser.harvestasya.org"
+                   proxy_address            = "127.0.0.1"
+                   proxy_port               = 0
+                   tcp_keep_alive           = "30s"
+                   tls_timeout              = "10s"
                }
            }
+           ingress_rule {
+               hostname = "navidrome.harvestasya.org"
+               service  = "https://traefik.traefik.svc.cluster.local"

+               origin_request {
+                   connect_timeout          = "30s"
+                   disable_chunked_encoding = false
+                   http2_origin             = false
+                   http_host_header         = "navidrome.harvestasya.org"
+                   keep_alive_connections   = 100
+                   keep_alive_timeout       = "1m30s"
+                   no_happy_eyeballs        = false
+                   no_tls_verify            = false
+                   origin_server_name       = "navidrome.harvestasya.org"
+                   proxy_address            = "127.0.0.1"
+                   proxy_port               = 0
+                   tcp_keep_alive           = "30s"
+                   tls_timeout              = "10s"
                }
            }
+           ingress_rule {
+               service = "http_status:404"
            }
        }
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.metrics will be created
+   resource "cloudflare_zero_trust_tunnel_cloudflared_config" "metrics" {
+       account_id = "********************************"
+       id         = (known after apply)
+       tunnel_id  = (known after apply)

+       config {
+           ingress_rule {
+               hostname = "grafana.harvestasya.org"
+               service  = "https://traefik"

+               origin_request {
+                   connect_timeout          = "30s"
+                   disable_chunked_encoding = false
+                   http2_origin             = false
+                   http_host_header         = "grafana.harvestasya.org"
+                   keep_alive_connections   = 100
+                   keep_alive_timeout       = "1m30s"
+                   no_happy_eyeballs        = false
+                   no_tls_verify            = true
+                   origin_server_name       = "grafana.harvestasya.org"
+                   proxy_address            = "127.0.0.1"
+                   proxy_port               = 0
+                   tcp_keep_alive           = "30s"
+                   tls_timeout              = "10s"
                }
            }
+           ingress_rule {
+               hostname = "prometheus.harvestasya.org"
+               service  = "https://traefik"

+               origin_request {
+                   connect_timeout          = "30s"
+                   disable_chunked_encoding = false
+                   http2_origin             = false
+                   http_host_header         = "prometheus.harvestasya.org"
+                   keep_alive_connections   = 100
+                   keep_alive_timeout       = "1m30s"
+                   no_happy_eyeballs        = false
+                   no_tls_verify            = true
+                   origin_server_name       = "prometheus.harvestasya.org"
+                   proxy_address            = "127.0.0.1"
+                   proxy_port               = 0
+                   tcp_keep_alive           = "30s"
+                   tls_timeout              = "10s"
                }
            }
+           ingress_rule {
+               service = "http_status:404"
            }
        }
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.storage_ingress will be created
+   resource "cloudflare_zero_trust_tunnel_cloudflared_config" "storage_ingress" {
+       account_id = "********************************"
+       id         = (known after apply)
+       tunnel_id  = (known after apply)

+       config {
+           ingress_rule {
+               hostname = "cdn.harvestasya.org"
+               service  = "https://traefik"

+               origin_request {
+                   connect_timeout          = "30s"
+                   disable_chunked_encoding = false
+                   http2_origin             = false
+                   http_host_header         = "cdn.harvestasya.org"
+                   keep_alive_connections   = 100
+                   keep_alive_timeout       = "1m30s"
+                   no_happy_eyeballs        = false
+                   no_tls_verify            = true
+                   origin_server_name       = "cdn.harvestasya.org"
+                   proxy_address            = "127.0.0.1"
+                   proxy_port               = 0
+                   tcp_keep_alive           = "30s"
+                   tls_timeout              = "10s"
                }
            }
+           ingress_rule {
+               hostname = "storage-console.harvestasya.org"
+               service  = "https://traefik"

+               origin_request {
+                   connect_timeout          = "30s"
+                   disable_chunked_encoding = false
+                   http2_origin             = false
+                   http_host_header         = "storage-console.harvestasya.org"
+                   keep_alive_connections   = 100
+                   keep_alive_timeout       = "1m30s"
+                   no_happy_eyeballs        = false
+                   no_tls_verify            = true
+                   origin_server_name       = "storage-console.harvestasya.org"
+                   proxy_address            = "127.0.0.1"
+                   proxy_port               = 0
+                   tcp_keep_alive           = "30s"
+                   tls_timeout              = "10s"
                }
            }
+           ingress_rule {
+               hostname = "storage.harvestasya.org"
+               service  = "https://traefik"

+               origin_request {
+                   connect_timeout          = "30s"
+                   disable_chunked_encoding = false
+                   http2_origin             = false
+                   http_host_header         = "storage.harvestasya.org"
+                   keep_alive_connections   = 100
+                   keep_alive_timeout       = "1m30s"
+                   no_happy_eyeballs        = false
+                   no_tls_verify            = true
+                   origin_server_name       = "storage.harvestasya.org"
+                   proxy_address            = "127.0.0.1"
+                   proxy_port               = 0
+                   tcp_keep_alive           = "30s"
+                   tls_timeout              = "10s"
                }
            }
+           ingress_rule {
+               service = "http_status:404"
            }
        }
    }

Plan: 6 to add, 10 to change, 6 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #61](https://github.com/suzutan/infra/actions/runs/11199366470)